request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:StudentService="https://XXX.XXX.XXX.XXX/qisserver/services2/StudentService"> <soapenv:Header> <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" > <wsse:UsernameToken> <wsse:Username>username</wsse:Username> <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">password</wsse:Password> </wsse:UsernameToken> </wsse:Security> </soapenv:Header> <soapenv:Body><StudentService:readStudentWithCoursesOfStudyByPersonId><personId>50095</personId></StudentService:readStudentWithCoursesOfStudyByPersonId></soapenv:Body> </soapenv:Envelope>
